{
  "title": "Engenheiro de Software full stack",
  "summary": "Sumário",
  "location": "Porto Alegre, Brasil",
  "exp": " com mais de 4 anos de experiência",
  "desc1": "Olá! Sou um brasileiro apaixonado por construir experiências de usuário de alto impacto e bem-performantes.",
  "desc2": "Acredito que o trabalho ocupa uma grande parte do meu dia, então tento tirar o melhor proveito para mim e meus colegas.",
  "desc3": "Para alcançar isso, foco na empatia durante as conversas e tento entregar algo com o qual eu esteja satisfeito.",
  "howConfortable": "Quão confortável estou com cada tecnologia",
  "years": "anos",
  "courses": "cursos",
  "nonExhaustive": "Lista não exaustiva de linguagens, tecnologias e ferramentas",
  "education": "Educação",
  "softwareEngineering": "Engenharia de Software",
  "systemsDevelopmentAndAnalysis": "Análise e Desenvolvimento de Sistemas",
  "languages": "Idiomas",
  "basedonCEFR": "Com base nos níveis de proficiência em idiomas CEFR",
  "portuguese": "Português",
  "english": "Inglês",
  "native": "nativo",
  "downloadCurriculum": "Baixar Currículo",
  "scheduleAmeeting": "Agendar uma reunião",
  "experience": {
    "ongoing": "Atual",
    "title": "Experiência",
    "softwareEngineer": "Engenheiro de Software",
    "contractorSoftwareEngineer": "Engenheiro de Software (Contractor)"
  },

  "whatsetsmeapart": {
    "title": "O que me destaca?",
    "reason1": "Demonstro alto desempenho para que <b>os colegas possam contar comigo</b>.",
    "reason2": "Sou <b>auto-motivado</b> com uma <b>paixão por aprender</b> e usar tecnologias de front-end e back-end.",
    "reason3": "Sou um <b>pensador de sistemas</b> que pode raciocinar sobre sistemas e <b>entender trade-offs técnicos</b>."
  },

  "workexp": {
    "notlisted": "Há uma experiência freelance que não está listada.",

    "bucksense": {
      "name": "Bucksense",
      "location": "EUA, Remoto",
      "desc": "Desenvolvimento de plataforma de reservas de cruzeiros de alto tráfego para a Crystal Cruises em equipe internacional e multifuncional.",
      "highlight1": "Otimização de desempenho com redução de imagens, cache de interface e imports dinâmicos, resultando em melhoria de ~20 pontos em métricas de performance",
      "highlight2": "Redução de ~30% nos custos da API Algolia através de caching otimizado, regeneração estática incremental e estratégias de consulta refinadas",
      "highlight3": "Criação de suíte de testes automatizados abrangendo impostos, moedas, reembolsos e cenários multicountry para aumento da confiabilidade do gateway de pagamento"
    },

    "sejaGudi": {
      "name": "Seja Gudi - Plataforma Cultural",
      "location": "Brasil, Remoto",
      "desc": "Desenvolvimento completo de uma plataforma sustentável de eventos culturais integrando reciclagem, pagamentos e gestão de eventos",
      "highlight1": "Desenvolvimento de aplicativos multiplataforma com React Native (mobile) e Next.js (web) utilizando backend Supabase + Prisma com lógica compartilhada",
      "highlight2": "Integração de geolocalização para descoberta de eventos culturais e pontos de reciclagem, com dashboards administrativos e controle de permissões",
      "highlight3": "Integração da API do Mercado Livre para pagamentos e sistema de recompensas de reciclagem com suporte a múltiplas moedas"
    },

    "quattrus": {
      "name": "Quattrus",
      "location": "Porto Alegre, Brasil",
      "desc": "Migração do frontend de sistemas empresariais de ExtJS para Next.js, modernizando a arquitetura e o stack tecnológico",
      "highlight1": "Eliminação de custos de licenciamento ExtJS e melhoria de manutenção com estratégia híbrida de renderização (SSG + SSR)",
      "highlight2": "Aumento de ~40% na velocidade de carregamento e implementação de pipelines CI/CD com deploys sem interrupção via Vercel",
      "highlight3": "Criação de design system privado com Tailwind CSS e ShadCN e desenvolvimento de plataforma de documentos corporativos com IA"
    },

    "alex": {
      "name": "Alex Rohleder LTDA",
      "location": "Noruega, Remoto",
      "desc": "Migração de sistema legado em Create React App para Next.js em plataforma de gestão de programas estudantis sazonais",
      "highlight1": "Arquitetura híbrida com coexistência de aplicações legadas e modernas, compartilhando motor de tradução e lógica de negócios",
      "highlight2": "Otimização de cache e webpack com integração Firebase para autenticação e dados em tempo real",
      "highlight3": "Criação de suíte automatizada de testes E2E, unitários e de snapshot para redução de bugs de regressão e aumento da estabilidade"
    },

    "speedCast": {
      "name": "Speedcast",
      "location": "EUA, Remoto",
      "desc": "Participação no desenvolvimento do Speedcast Compass, portal empresarial para monitoramento e gestão de redes via satélite",
      "highlight1": "Redesenho de sistema legado em aplicação moderna e responsiva com visualização aprimorada de dados",
      "highlight2": "Integração do ArcGIS API para visualização 3D em tempo real de satélites e cobertura de rede",
      "highlight3": "Desenvolvimento de módulos para processamento de big data e exportação de relatórios (CSV, XLSX) para análise de desempenho"
    },

    "switchApp": {
      "name": "Switch App",
      "location": "Brasil, Remoto",
      "desc": "Aprimoramento de plataforma de recrutamento voltada ao setor de hospitalidade, conectando profissionais e empregadores",
      "highlight1": "Desenvolvimento e otimização de módulos de boletos e gestão de PDFs com conformidade aos padrões locais de pagamento",
      "highlight2": "Modernização de componentes de interface e melhoria da responsividade para aumento da retenção de usuários",
      "highlight3": "Colaboração com equipe de produto em refinamento de layouts e usabilidade da plataforma"
    },

    "lucalto": {
      "name": "Lucalto",
      "location": "Noruega, Remoto",
      "desc": "Desenvolvimento do Inkhall, rede social de nicho voltada para tatuadores e entusiastas, desde o conceito até o lançamento",
      "highlight1": "Participação no ciclo completo do produto — concepção, desenvolvimento e entrega — com adoção inicial pela comunidade-alvo",
      "highlight2": "Implementação de autenticação, modelos de banco de dados e layouts responsivos com Next.js, Supabase e Prisma ORM",
      "highlight3": "Experiência prática em desenvolvimento full-stack e colaboração multidisciplinar em ambiente de startup"
    }
  },

  "projects": {
    "title": "Projetos",
    "openSource": "Código Aberto",
    "mentoring": {
      "title": "Mentoria - ainda em andamento, prévia abaixo",
      "desc1": "Sistema de mentoria com correspondência entre mentor e aluno",
      "desc2": "Chat em tempo real",
      "desc3": "Autenticação e registro de usuários"
    },
    "ecommerce": {
      "title": "E-commerce",
      "desc1": "Loja virtual simples com Stripe",
      "desc2": "Pagamento de produtos",
      "desc3": "Cadastro e autenticação"
    },
    "blog": {
      "title": "Blog",
      "desc1": "Criação de conta e gerenciamento de postagens",
      "desc2": "Comente e reaja às postagens"
    },
    "certificates": {
      "title": "Emissão de Certificados",
      "desc1": "Envio de certificados PDF personalizados",
      "desc2": "Certificados podem conter nomes e datas de alunos",
      "desc3": "Campos de texto e data podem ser posicionados antes do envio por e-mail"
    },
    "autofill": {
      "title": "Preenchimento Automático de Candidaturas",
      "desc1": "Aplicativo desenvolvido em Electron.js para preencher formulários de emprego automaticamente",
      "desc2": "Utiliza Puppeteer para automação de navegação e envio"
    },
    "linkedinJobBot": {
      "title": "WishApply - Bot de Vagas no LinkedIn",
      "desc1": "Aplicativo de desktop criado em Electron.js e Node.js com integração de IA para aplicar automaticamente em vagas no LinkedIn",
      "desc2": "Pesquisa vagas, preenche formulários e gera cartas de apresentação personalizadas usando modelos de IA",
      "desc3": "Lançado em 2025 como WishApply, simplificando o processo de candidatura automatizada"
    }
  },

  "footer": "Feito com <span className='text-red-700'>❤️</span> por Ismael Rodino"
}
