{
  "title": "Fullstack software engineer",
  "summary": "Summary",
  "location": "Porto Alegre, Brazil",
  "exp": " with over 4 years of experience",
  "desc1": "Hey! I'm a Brazilian who is passionate about building high-impact, well-performing user experiences.",
  "desc2": "I believe that work is a big portion of my day, so I try to make the best out of it for me and my colleagues.",
  "desc3": "To achieve that I focus on empathy during conversations and try to deliver something I'm happy with.",
  "howConfortable": "How confortable I'm with each technology",
  "years": "years",
  "courses": "courses",
  "nonExhaustive": "Non-exhaustive list of languages, technologies and tools",
  "education": "Education",
  "softwareEngineering": "Software Engineering",
  "systemsDevelopmentAndAnalysis": "Systems Development & Analysis",
  "languages": "Languages",
  "basedonCEFR": "Based on CEFR language proficiency levels",
  "portuguese": "Portuguese",
  "english": "English",
  "native": "native",
  "downloadCurriculum": "Download Curriculum",
  "scheduleAmeeting": "Schedule a meeting",
  "experience": {
    "ongoing": "Ongoing",
    "title": "Experience",
    "softwareEngineer": "Software Engineer",
    "contractorSoftwareEngineer": "Contractor Software Engineer"
  },

  "whatsetsmeapart": {
    "title": "What sets me apart?",
    "reason1": "I demonstrate strong performance so <b>colleagues can rely upon me</b>.",
    "reason2": "I'm <b>self-motivated</b> with a <b>passion for learning</b> and using both front and back-end technologies.",
    "reason3": " I'm a <b>systems thinker</b> who can reason through systems and <b>understand technical tradeoffs</b>."
  },

  "workexp": {
    "notlisted": "There is one freelance working experience that is not listed.",

    "bucksense": {
      "name": "Bucksense",
      "location": "USA, Remote",
      "desc": "Developing a high-traffic cruise booking platform for Crystal Cruises with an international, cross-functional team.",
      "highlight1": "Improved performance scores by ~20 points via image optimization, UI caching, and dynamic imports, enhancing booking flow speed and user experience.",
      "highlight2": "Reduced Algolia API costs by ~30% through optimized caching, incremental static regeneration, and refined query strategies.",
      "highlight3": "Strengthened payment gateway reliability with a comprehensive automated testing suite covering tax, currency, refund, and multi-country scenarios."
    },

    "sejaGudi": {
      "name": "Seja Gudi - Cultural Platform",
      "location": "Brazil, Remote",
      "desc": "Led end-to-end development of a sustainable cultural events platform integrating recycling incentives, payments, and event management.",
      "highlight1": "Developed cross-platform applications using React Native (mobile) and Next.js (web), sharing business logic with a Supabase + Prisma backend.",
      "highlight2": "Integrated geolocation for cultural event discovery and recycling points, including role-based admin dashboards for event management.",
      "highlight3": "Connected Mercado Livre API for payments and reward redemption, enabling multi-currency support and sustainable monetization."
    },

    "quattrus": {
      "name": "Quattrus",
      "location": "Porto Alegre, Brazil",
      "desc": "Led the frontend migration from ExtJS to Next.js for enterprise management systems, aligning the company’s stack with modern web standards.",
      "highlight1": "Eliminated ExtJS licensing costs and improved maintainability using a hybrid rendering strategy combining SSG and SSR.",
      "highlight2": "Increased page load speed by ~40% and implemented CI/CD pipelines on Vercel with zero-downtime deployments.",
      "highlight3": "Built a private design system with Tailwind CSS and ShadCN, and led development of an AI-powered business document interpretation platform."
    },

    "alex": {
      "name": "Alex Rohleder LTDA",
      "location": "Norway, Remote",
      "desc": "Led migration of a legacy Create React App to Next.js for an energy company managing seasonal student programs.",
      "highlight1": "Designed hybrid architecture allowing legacy and modern apps to coexist, sharing translation engines and business logic modules.",
      "highlight2": "Enhanced caching strategies, optimized webpack configuration, and integrated Firebase for authentication and real-time features.",
      "highlight3": "Established automated E2E, unit, and snapshot testing to reduce regression bugs and improve platform stability during seasonal peaks."
    },

    "speedCast": {
      "name": "Speedcast",
      "location": "USA, Remote",
      "desc": "Contributed to Speedcast Compass, an enterprise platform for monitoring and managing remote satellite networks.",
      "highlight1": "Redesigned the legacy system into a modern, responsive web app with enhanced data visualization and usability.",
      "highlight2": "Integrated ArcGIS API for real-time 3D satellite visualization and coverage monitoring directly within the main dashboard.",
      "highlight3": "Developed modules to process and transform big data into downloadable reports (CSV, XLSX), supporting performance analysis."
    },

    "switchApp": {
      "name": "Switch App",
      "location": "Brazil, Remote",
      "desc": "Enhanced a hospitality recruitment platform connecting professionals to jobs across the service and hospitality sectors.",
      "highlight1": "Developed and optimized payment slip and PDF management modules ensuring compliance with Brazilian payment standards.",
      "highlight2": "Modernized UI components and refined layout responsiveness, resulting in higher user retention and engagement.",
      "highlight3": "Collaborated with the product team to improve UX consistency and streamline the hiring flow experience."
    },

    "lucalto": {
      "name": "Lucalto",
      "location": "Norway, Remote",
      "desc": "Contributed to the development and launch of Inkhall, a niche social network for tattoo artists and enthusiasts.",
      "highlight1": "Helped bring the product from concept to production, enabling early adoption within the tattoo artist community.",
      "highlight2": "Implemented authentication flows, database models, and responsive layouts using Next.js, Supabase, and Prisma ORM.",
      "highlight3": "Gained strong full-stack development experience and improved collaboration skills in a startup environment."
    }
  },

  "projects": {
    "title": "Projects",
    "openSource": "Open Source",
    "mentoring": {
      "title": "Mentoring - ongoing project, preview below",
      "desc1": "Mentor-mentee matching system",
      "desc2": "Real-time chat functionality",
      "desc3": "Authentication and user registration"
    },
    "ecommerce": {
      "title": "E-commerce",
      "desc1": "Simple online store built with Stripe integration",
      "desc2": "Product checkout and payments",
      "desc3": "Account creation and authentication"
    },
    "blog": {
      "title": "Blog",
      "desc1": "Create an account and manage posts",
      "desc2": "Comment and react to articles"
    },
    "certificates": {
      "title": "Certificate Issuing System",
      "desc1": "Send customized PDF certificates",
      "desc2": "Certificates include student names and dates",
      "desc3": "Text/date fields can be positioned before email delivery"
    },
    "autofill": {
      "title": "Automatic Job Application Autofill",
      "desc1": "Electron.js app for automatically filling out job application forms",
      "desc2": "Uses Puppeteer for automation and form submission"
    },
    "linkedinJobBot": {
      "title": "WishApply - LinkedIn Job Application Bot",
      "desc1": "Desktop app built with Electron.js and Node.js that uses AI to apply automatically for jobs on LinkedIn",
      "desc2": "Searches job listings, fills forms, and generates personalized cover letters using AI models",
      "desc3": "Released in 2025 as WishApply, simplifying the automated job application process"
    }
  },

  "footer": "Made with <span className='text-red-700'>❤️</span> by Ismael Rodino"
}
