{
  "title": "Fullstack software engineer",
  "summary": "Summary",
  "location": "Porto Alegre, Brazil",
  "exp": " with over 4 years of experience",
  "desc1": "Hey! I'm a Brazilian who is passionate about building high-impact, well-performing user experiences.",
  "desc2": "I believe that work is a big portion of my day, so I try to make the best out of it for me and my colleagues.",
  "desc3": "To achieve that I focus on empathy during conversations and try to deliver something I'm happy with.",
  "howConfortable": "How confortable I'm with each technology",
  "years": "years",
  "courses": "courses",
  "nonExhaustive": "Non-exhaustive list of languages, technologies and tools",
  "education": "Education",
  "softwareEngineering": "Software Engineering",
  "systemsDevelopmentAndAnalysis": "Systems Development & Analysis",
  "languages": "Languages",
  "basedonCEFR": "Based on CEFR language proficiency levels",
  "portuguese": "Portuguese",
  "english": "English",
  "native": "native",
  "downloadCurriculum": "Download Curriculum",
  "scheduleAmeeting": "Schedule a meeting",
  "experience": {
    "ongoing": "Ongoing",
    "title": "Experience",
    "softwareEngineer": "Software Engineer",
    "contractorSoftwareEngineer": "Contractor Software Engineer"
  },

  "whatsetsmeapart": {
    "title": "What sets me apart?",
    "reason1": "I demonstrate strong performance so <b>colleagues can rely upon me</b>.",
    "reason2": "I'm <b>self-motivated</b> with a <b>passion for learning</b> and using both front and back-end technologies.",
    "reason3": " I'm a <b>systems thinker</b> who can reason through systems and <b>understand technical tradeoffs</b>."
  },

  "workexp": {
    "notlisted": "There is one freelance working experience that is not listed.",
    "bucksense": {
      "name": "Bucksense",
      "location": "USA, Remote",
      "desc": "Developing high-traffic cruise booking platform for Crystal Cruises with international cross-functional team.",
      "highlight1": "Improved performance scores by ~20 points through image optimization, UI caching, and dynamic imports",
      "highlight2": "Reduced Algolia API costs by ~30% through optimized search caching and server-side strategies",
      "highlight3": "Strengthened payment gateway reliability with comprehensive testing suite covering multi-country scenarios"
    },
    "sejaGudi": {
      "name": "Seja Gudi - Cultural Platform",
      "location": "Brazil, Remote",
      "desc": "Led end-to-end development of a multi-platform social network for cultural events and recycling initiatives.",
      "highlight1": "Built cross-platform apps using React Native (mobile) and Next.js (web) with shared business logic",
      "highlight2": "Integrated geolocation services for event discovery and admin dashboard with role-based permissions",
      "highlight3": "Connected Mercado Livre API for payments and reward systems with multi-currency support"
    },
    "quattrus": {
      "name": "Quattrus",
      "location": "Porto Alegre, Brazil",
      "desc": "Led frontend team migration from ExtJS to Next.js for enterprise management applications.",
      "highlight1": "Eliminated ExtJS licensing costs and improved maintainability with modern web standards",
      "highlight2": "Increased page load speed by ~40% using hybrid rendering and Vercel deployment with CI/CD",
      "highlight3": "Created private company-wide design system with Tailwind CSS and led AI-powered document platform development"
    },
    "alex": {
      "name": "Alex Rohleder LTDA",
      "location": "Norway, Remote",
      "desc": "Led migration of legacy Create React App to Next.js for energy company platform managing seasonal student programs.",
      "highlight1": "Designed hybrid architecture to run old and new applications in same codebase with shared translation engine",
      "highlight2": "Enhanced caching strategies, optimized webpack, and integrated Firebase for authentication and real-time data",
      "highlight3": "Established automated E2E, unit, and snapshot tests reducing regression bugs during peak usage"
    },
    "speedCast": {
      "name": "Speedcast",
      "location": "USA, Remote",
      "desc": "Contributed to Speedcast Compass, enterprise portal for monitoring and managing remote satellite networks.",
      "highlight1": "Transformed legacy system into modern, responsive web application with improved data visualization",
      "highlight2": "Integrated ArcGIS API for real-time 3D satellite positioning and coverage monitoring",
      "highlight3": "Designed modules to process big data into downloadable reports (CSV, XLSX) for network analysis"
    },
    "switchApp": {
      "name": "Switch App",
      "location": "Brazil, Remote",
      "desc": "Enhanced hospitality recruitment platform connecting professionals to job opportunities using React.js, Node.js, and PostgreSQL.",
      "highlight1": "Developed payment slip and PDF document management features ensuring local payment standards compliance",
      "highlight2": "Modernized UI components and improved responsiveness contributing to higher user retention rates",
      "highlight3": "Collaborated with product team to refine layouts and enhance platform usability across devices"
    },
    "lucalto": {
      "name": "Lucalto",
      "location": "Norway, Remote",
      "desc": "Contributed to development and launch of Inkhall, a niche social network for tattoo artists.",
      "highlight1": "Helped bring platform from concept to production enabling early user adoption in target community",
      "highlight2": "Gained hands-on experience with Next.js, Supabase, and Prisma ORM in startup environment",
      "highlight3": "Implemented authentication flows, database models, and responsive layouts while learning cross-functional collaboration"
    }
  },

  "projects": {
    "title": "Projects",
    "openSource": "Open Source",
    "mentoring": {
      "title": "Mentoring - still in progress, preview bellow",
      "desc1": "Possibility to mentor and be mentored with match system",
      "desc2": "Real time chat",
      "desc3": "Authentication and registration"
    },
    "ecommerce": {
      "title": "E-commerce",
      "desc1": "Simple e-commerce with stripe",
      "desc2": "Checkout products",
      "desc3": "Registration and authentication"
    },
    "blog": {
      "title": "Blog",
      "desc1": "Create account and manage posts",
      "desc2": "Comment/react to posts."
    },
    "certificates": {
      "title": "Certificates sender",
      "desc1": "Sending customized PDF certificates",
      "desc2": "Certificates can be named after students, dates",
      "desc3": "Text/date fields can be positioned in the PDF before emailing"
    },
    "autofill": {
      "title": "Job autofill",
      "desc1": "App made in Electron.js to automatically fill job forms",
      "desc2": "Use puppeteer for automation"
    },
    "linkedinJobBot": {
      "title": "LinkedIn Job Application Bot",
      "desc1": "An AI-powered bot that automatically applies for job openings on LinkedIn",
      "desc2": "Automated job search, application submission, and customized cover letter generation",
      "desc3": "Published in 2025 as WishApply"
    },
    "wishApply": {
      "title": "WishApply - AI Job Application Platform",
      "desc1": "Revolutionary AI-powered job application platform that automates the entire job search process",
      "desc2": "Smart bot applies to hundreds of relevant LinkedIn jobs while you relax",
      "desc3": "Advanced machine learning with stealth technology for undetectable, authentic applications"
    }
  },

  "footer": "Made with <span className='text-red-700'>❤️</span> by Ismael Rodino"
}
